<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 12. Даты праздников. </title>		
	</head>
	<body>
		<h1> 12. Даты праздников <span class="a_marker"> (в коде есть строки из следующих тем: "словари, строки, циклы"). </span> </h1>
		<div> <a class="link_task" href="./1.2.12.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			В Канаде есть три национальных праздника, отмечающихся в одни и те же даты каждый год: <br>
			- Новый год - 1 января <br>
			- День Канады - 1 июля <br>
			- Рождество - 25 декабря <br>
			Напишите программу, которая будет запрашивать у пользователя день и месяц. Если введенные данные в точности указывают на один из перечисленных в таблице праздников, необходимо вывести его название. В противном случае сообщить, что на заданную дату праздники не приходятся.
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
holidays = {
    "Happy new year": "1 january",
    "Day of Canada": "1 july",
    "Christmas": "25 december"
}

month = input("%100s" % "Введите месяц по-английски полностью (к примеру: january или february): ")
day = input("%100s" % "Введите день месяца (к примеру: 1 или 10): ")

plus = day + " " + month

test = True
for holiday, date in zip(holidays.keys(), holidays.values()):                                       # функция zip обходит в цикле параллельно сразу два значения и может обатиться к любому из них, так и к другому за один проход
    if plus in date:
        print("%99s" % "На данную дату попадает праздник:", holiday)
        test = False    
if test:
    print("%99s" % "На данную дату не приходятся праздники.")
		</pre>		
	</body>
</html>