<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 10. Билеты в зоопарк. </title>		
	</head>
	<body>
		<h1> 10. Билеты в зоопарк. <span class="a_marker"> (в коде есть строки из следующих тем: "словари, функции"). </span> </h1>
		<div> <a class="link_task" href="./1.3.10.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			В зоопарке цена входного билета зависит от возраста посетителя. 
			Дети до двух лет допускаются бесплатно. Дети в возрасте от трех до 12 лет могут посещать зоопарк за $14,00. Пенсионерам старше 65 лет вход обойдется в $18,00, а обычный взрослый билет стоит $23,00. <br>
			Напишите программу, которая будет запрашивать возраст всех посетителей в группе (по одному за раз) и выводить общую цену билетов для посещения зоопарка этой группой. 
			В качестве индикатора окончания ввода можно использовать пустую строку. Общую цену билетов стоит выводить в формате с двумя знаками после запятой.										 
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
def price(tickets, age):
    for a, b in tickets.items():
        if age in b:
            price = float(a.removesuffix("$"))
    return price


tickets = {
    "0$": range(0, 3),
    "12$": range(3, 13),
    "18$": range(65, 100),
    "23$": range(13, 65)
}

amount = 0
while True:
    age = input("%75s" % "Введите возраст посетителя (количество полных лет): ")
    if age == "":
        break
    try:
        age = int(age)
        amount += price(tickets, age)
    except:
        print("%74s" % "Введены некорректные данные.")
print("%74s" % "Общая цена билетов: ", round(amount, 2), "$")
		</pre>				
	</body>
</html>