<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 11. Гипотеза Коллатца. </title>		
	</head>
	<body>
		<h1> 11. Гипотеза Коллатца. </h1>
		<div> <a class="link_task" href="./1.3.11.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			<pre>
Представьте себе последовательность целых чисел, организованную следующим образом:
- начинаться последовательность должна с любого положительного числа;
- пока последний элемент последовательности не равен единице, выполнять:
       *** если последний элемент последовательности четный, тогда добавить новый элемент к последовательности путем деления последнего элемента на два с округлением вниз;
       *** иначе добавить новый элемент к последовательности путем умножения последнего элемента на три с добавлением единицы.
Гипотеза Коллатца утверждает, что подобная последовательность при условии того, что начинается с положительного числа, рано или поздно завершится единицей. И хотя это так и не было доказано, все указывает на то, что это так и есть.
Напишите программу, которая будет запрашивать у пользователя целое число и выводить все числа, начиная с введенного числа и заканчивая единицей.			
			</pre>										 
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
list_of_digits = list()
while True:
    try:
        digit = int(input("Введите целое положительное число: "))
        if digit > 0:
            break
    except:
        print("Вы ввели не цифры. Попробуйте ещё раз.")
list_of_digits.append(digit)

while True:
    print(list_of_digits)
    if list_of_digits[-1] == 1:        
        break
    if list_of_digits[-1] % 2 == 0:
        list_of_digits.append(int(list_of_digits[-1] / 2))
    else:
        list_of_digits.append(list_of_digits[-1] * 3 + 1)
		</pre>				
	</body>
</html>