<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 42. Отображаем начало файла. </title>		
	</head>
	<body>
		<h1> 42. Отображаем начало файла. </h1>
		<div> <a class="link_task" href="./1.7.42.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			Необходимо написать программу, которая будет работать из консоли. При запуске программы, ей нужно передать параметр: <br> 
			py 1.7.42.task.py 1.7.42-43.txt <br>
			py - это питон в Linux <br>
			1.7.42.task.py - это название нашей программы <br>
			1.7.42-43.txt - это переданный в качестве аргумента файл, который находится в том же каталоге, что и наш скрипт <br>
			Программа должна вывести первые три строки. <br>
			Файл 1.7.42-43.txt, есть в репозитории на GitHub. <br>
			Он простой можно его создать руками. Содержание: <br>
			Hello, <br>
			world <br>
			!!! <br>
			My <br>
			OS <br>
			is <br>
			Fedora 38.				
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
from sys import argv                            # импортируем argv из библиотеки sys (нужно для работы с командной строкой)

try:
    script, first = argv                        # первый параметр - это название скрипта, второй - это название файла, который мы передаём скрипту
    buf = open(f"./{first}", "r")               # читаем данные из файла, путь к файлу состоит из: ./ - читать в тек. каталоге, first - переданное название файла
    s = buf.readlines()                         # превращаем строки в список
    for i in s[0:3]:             
        print(i.strip())                        # в цикле печатаем элементы списка без значка переноса строки /n
except:
    print("Вы сделали ошибку в вводе.")		
		</pre>
	</body>
</html>