<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 50. Случайный пароль из двух слов. </title>		
	</head>
	<body>
		<h1> 50. Случайный пароль из двух слов. </h1>
		<div> <a class="link_task" href="./1.7.50.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			Создание пароля посредством генерирования случайных символов может обернуться сложностью в запоминании полученной относительно надежной последовательности. 
			Некоторые системы создания паролей рекомендуют сцеплять вместе два слова на английском языке, тем самым упрощая запоминание заветного ряда символов – правда, в ущерб его надежности. <br> 
			Напишите программу, которая будет открывать файл со списком слов, случайным образом выбирать два из них и сцеплять вместе для получения итогового пароля. 
			При создании пароля исходите из следующего требования: он должен состоять минимум из восьми символов и максимум из десяти, а каждое из используемых слов должно быть длиной хотя бы в три буквы. 
			Кроме того, сделайте заглавными первые буквы обоих слов, чтобы легко можно было понять, где заканчивается одно и начинается другое. 
			По завершении процесса полученный пароль должен быть отображен на экране. <br>
			Только в примере я буду обрабатывать не английские буквы, а русские. <br>
			Предлагаю воспользоваться готовым файлом, который называется pushkin.txt (это Сказка о мертвой царевне и о семи богатырях): <a href="../../add/pushkin.txt" download="А.С. Пушкин"> ⇒ А.С. Пушкин </a> <br>
			Программа должна запускаться из командной строки и получать файл pushkin.txt в качестве аргумента.			
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
from sys import argv
from random import choice

try:
    script, first = argv         
    buf = open(f"./{first}", "r")       
    text = buf.read()                                                                                           # прочитаем текст сразу весь
    text = text.replace("\n", "")                                                                               # уберём переносы строк
    text = text.lower()                                                                                         # сделаем все буквы в нижнем регистре
    stay = " "                                                                                                  # часть символов, кот. не будем убирать из текста
    result = ""                                                                                                 # сюда будем копить модифицированный текст
    for i in text:                                  
        if i in stay or ("а" &lt;= i &lt;= "я"):                                  
            result += i                                 
    result = result.split(" ")                                                                                  # так создадим список из текста, где разделитель " "
    result = [i for i in result if 3 &lt;= len(i) &lt;= 7]                                                            # модифицируем список, где все элементы от 3 символов до 7
    result = [i.capitalize() for i in result]                                                                   # модифицируем список, теперь все элементы списка начинаются с заглавной буквы
    element_1 = choice(result)                                                                                  # первый элемент    
    element_2 = choice([i for i in result if ((8 - len(element_1)) &lt;= len(i) &lt;= (10 - len(element_1)))])        # второй элемент
    password = element_1 + element_2
    print(password)
except:
    print("Имя файла не существует или слишком много аргументов.")		
		</pre>
	</body>
</html>