<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 6. Наибольший общий делитель. </title>		
	</head>
	<body>
		<h1> 6. Наибольший общий делитель. </h1>
		<div> <a class="link_task" href="./recursion_6_greatest_common_divisor.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			Напишите программу, реализующую алгоритм Евклида для определения наибольшего общего делителя двух положительных чисел, введенных пользователем. 
			Проверьте программу на работоспособность с очень большими числами. 
			Результат должен высчитываться очень быстро даже для огромных входных значений, состоящих из сотен чисел. Причина заключается в очень высокой эффективности данного алгоритма. <br>
			Этот алгоритм описывается так: <br>
			Если b = 0, тогда возвращаем a - базовый случай <br>
			Иначе передаём в рекурсию (b,  a % b).			 
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
def my_def(a, b):
    if b == 0:                                              
        return a
    else:
        return my_def(b, a % b)


a = int(input("%100s" % "Введите целое число (a): "))
b = int(input("%100s" % "Введите целое число (b): "))

result = my_def(a, b)

print("%99s" % result)			
		</pre>
	</body>
</html>