<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 6. Среднее значение. </title>		
	</head>
	<body>
		<h1> 6. Среднее значение. </h1>
		<div> <a class="link_task" href="./1.3.6.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			В данном упражнении вы должны написать программу для подсчета среднего значения всех введенных пользователем чисел. 
			Индикатором окончания ввода будет служить ноль. При этом программа должна выдавать соответствующее сообщение об ошибке, если первым же введенным пользователем значением будет ноль.										 
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
digit = int(input("%50s" % "Введите целое число (кроме нуля): "))
while True:
    if digit == 0:
        digit = int(input("%50s" % "Введите целое число (кроме нуля): "))
    else:
        break
amount = digit
count = 1
while True:
    digit = int(input("%50s" % "Введите целое число (нуля для выхода): "))
    if digit == 0:
        break
    else:
        amount += digit
        count += 1
result = amount / count
print("%49s" % "Среднее значение округлённое до целого:", int(result + 0.5))
		</pre>				
	</body>
</html>