<!DOCTYPE html>
<html lang="ru">
	<head>
		<meta name="Dmitry Rubtsov." content="Dmitry Rubtsov.">
		<meta name="generator" content="Bluefish 2.2.14" >
		<meta charset="utf-8">
		<meta name="robots" content="noindex, nofollow">
		<link rel="stylesheet" href="../content.css">		
		<title> 29. Азбука Морзе. </title>		
	</head>
	<body>
		<h1> 29. Азбука Морзе. </h1>
		<div> <a class="link_task" href="./1.6.29.task.html" target="_blank"> (открыть в новой вкладке) </a> </div>
		<hr>
		<div> 
			<span> Условие: </span> <br>
			<hr>			
			Азбука Морзе зашифровывает буквы и цифры при помощи точек и тире. В данном упражнении вам необходимо написать программу, в которой соответствие символов из азбуки Морзе будет храниться в виде словаря. <br>
			morze_dict = { <br>
			    "a": ".-", <br>
			    "b": "-...", <br>
			    "c": "-.-.", <br>
			    "d": "-..", <br>
			    "e": ".", <br>
			    "f": "..-.", <br>
				 "g": "--.", <br>
		       "h": "....", <br>
			    "i": "..", <br>
			    "j": ".---", <br>
			    "k": "-.-", <br>
			    "l": ".-..", <br>
			    "m": "--", <br>
			    "n": "-.", <br>
			    "o": "---", <br>
			    "p": ".--.", <br>
			    "q": "--.-", <br>
			    "r": ".-.", <br>
			    "s": "...", <br>
			    "t": "-", <br>
			    "u": "..-", <br>
			    "v": "...-", <br>
			    "w": ".--", <br>
			    "x": "-..-", <br>
			    "y": "-.--", <br>
			    "z": "--..", <br>
			    "0": "-----", <br>
			    "1": ".----", <br>
			    "2": "..---", <br>
			    "3": "...--", <br>
			    "4": "....-", <br>
			    "5": ".....", <br>
			    "6": "-....", <br>
			    "7": "--...", <br>
			    "8": "---..", <br>
			    "9": "----." <br>
				} <br>
				В программе вам необходимо запросить у пользователя строку. 
				После этого программа должна преобразовать его в соответствующую последовательность точек и тире, вставляя пробелы между отдельными символами. 
				Символы, не представленные в таблице, можно игнорировать. 
				Например, сообщение Hello, World! может быть представлено следующей последовательностью: .... . .–.. .–.. ––– .–– ––– .–. .–.. –..
		</div>		
		<hr>
		<div>
			<span> Код: </span>
		</div>
		<hr>
		<pre>
# ввод данных
morze_dict = {
    "a": ".-",
    "b": "-...",
    "c": "-.-.",
    "d": "-..",
    "e": ".",
    "f": "..-.",
    "g": "--.",
    "h": "....",
    "i": "..",
    "j": ".---",
    "k": "-.-",
    "l": ".-..",
    "m": "--",
    "n": "-.",
    "o": "---",
    "p": ".--.",
    "q": "--.-",
    "r": ".-.",
    "s": "...",
    "t": "-",
    "u": "..-",
    "v": "...-",
    "w": ".--",
    "x": "-..-",
    "y": "-.--",
    "z": "--..",
    "0": "-----",
    "1": ".----",
    "2": "..---",
    "3": "...--",
    "4": "....-",
    "5": ".....",
    "6": "-....",
    "7": "--...",
    "8": "---..",
    "9": "----."
}

text = input("%100s" % "Введите текст на английском: ")
text = text.lower()
for i in text:
    if i == " ":
        print(i, end="")
    else:
        for a, b in morze_dict.items():                           
            if i == a:
                print((b + " "), end="")
print()        
print()        
		</pre>				
	</body>
</html>